Revit 2024 API
MEPConnectorInfo Class
 MEP connector information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class MEPConnectorInfo : IDisposable
Visual Basic
Public Class MEPConnectorInfo _
	Implements IDisposable
Visual C++
public ref class MEPConnectorInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPConnectorInfo
 Autodesk.Revit.DB.MEPFamilyConnectorInfo
See Also
MEPConnectorInfo Members
Autodesk.Revit.DB Namespace